<template>
    <div id="aplayer" :style="styleObj1" class="aplayer">
        <pre class="aplayer-lrc-content">
                [ti:芒种]
                [ar:音阙诗听/赵方婧]
                [al:芒种]
                [by:]
                [offset:0]
                [00:00.00]芒种 - 音阙诗听 (interestingcn)/赵方婧 (wimi)
                [00:00.07]词：假寐
                [00:00.14]曲：殇小谨
                [00:00.21]编曲：Morri3on(喬凡三)
                [00:00.28]混音：殇小谨
                [00:00.35]母带处理：殇小谨
                [00:00.42]和声：皎月
                [00:00.49]和声编写：皎月
                [00:00.56]文案：偏生梓归
                [00:00.63]古筝：紫格
                [00:00.70]古筝编写：紫格/Morri3on(喬凡三)
                [00:00.77]小提琴：大琴KoTo
                [00:00.84]小提琴编写：大琴KoTo
                [00:00.91]制作人：殇小谨
                [00:00.98]录音室：Hi Music Studio
                [00:01.05]混音室：Hi Music Studio
                [00:01.12]监制：李俊羽
                [00:01.19]出品：音阙诗听
                [00:01.26]一想到你我就
                [00:02.98]Wu
                [00:04.84]空恨别梦久
                [00:07.20]Wu
                [00:09.64]烧去纸灰埋烟柳
                [00:12.90]
                [00:33.60]于鲜活的枝丫
                [00:35.98]凋零下的无暇
                [00:38.36]是收获谜底的代价
                [00:42.27]余晖沾上 远行人的发
                [00:45.53]他洒下手中牵挂
                [00:49.39]于桥下
                [00:51.58]前世迟来者
                [00:53.00]擦肩而过
                [00:54.56]掌心刻
                [00:55.76]来生记得
                [00:56.98]你眼中烟波滴落一滴墨 wo
                [01:01.82]若佛说
                [01:02.67]无牵无挂
                [01:03.86]放下执着
                [01:05.69]无相无色
                [01:06.64]我怎能 波澜不惊 去附和
                [01:10.78]一想到你我就
                [01:12.54]Wu
                [01:14.41]恨情不寿 总于苦海囚
                [01:16.77]Wu
                [01:19.21]新翠徒留 落花影中游
                [01:21.55]Wu
                [01:23.97]相思无用 才笑山盟旧
                [01:26.35]Wu
                [01:29.91]谓我何求
                [01:39.64]谓我何求
                [01:43.25]种一万朵莲花
                [01:45.56]在众生中发芽
                [01:48.00]等红尘一万种解答
                [01:51.93]念珠落进 时间的泥沙
                [01:55.16]待 割舍诠释慈悲
                [01:59.04]的读法
                [02:01.16]前世迟来者
                [02:02.61]擦肩而过
                [02:04.17]掌心刻
                [02:05.30]来生记得
                [02:06.65]你眼中烟波滴落一滴墨 wo
                [02:11.45]若佛说
                [02:12.30]无牵无挂
                [02:13.64]放下执着
                [02:15.16]无相无色
                [02:16.19]我怎能 波澜不惊 去附和
                [02:22.76]一想到你我就
                [02:24.53]Wu
                [02:26.46]恨情不寿 总于苦海囚
                [02:28.74]Wu
                [02:31.17]新翠徒留 落花影中游
                [02:33.56]Wu
                [02:36.02]相思无用 才笑山盟旧
                [02:38.35]Wu
                [02:41.99]谓我何求
                [02:51.56]谓我何求
            </pre>
        <pre class="aplayer-lrc-content">
                [ti:晴天]
                [ar:周杰伦]
                [al:叶惠美]
                [by:]
                [offset:0]
                [00:00.00]晴天 - 周杰伦 (Jay Chou)
                [00:07.31]词：周杰伦
                [00:14.63]曲：周杰伦
                [00:21.94]编曲：周杰伦
                [00:29.26]故事的小黄花
                [00:32.71]从出生那年就飘着
                [00:36.24]童年的荡秋千
                [00:39.75]随记忆一直晃到现在
                [00:42.91]Re So So Si Do Si La
                [00:45.93]So La Si Si Si Si La Si La So
                [00:49.87]吹着前奏望着天空
                [00:53.20]我想起花瓣试着掉落
                [00:56.72]为你翘课的那一天
                [00:58.83]花落的那一天
                [01:00.60]教室的那一间
                [01:02.32]我怎么看不见
                [01:04.12]消失的下雨天
                [01:05.81]我好想再淋一遍
                [01:09.99]没想到失去的勇气我还留着
                [01:16.12]好想再问一遍
                [01:17.97]你会等待还是离开
                [01:24.91]刮风这天我试过握着你手
                [01:30.45]但偏偏雨渐渐大到我看你不见
                [01:38.88]还要多久我才能在你身边
                [01:45.44]等到放晴的那天也许我会比较好一点
                [01:52.87]从前从前有个人爱你很久
                [01:58.54]但偏偏风渐渐把距离吹得好远
                [02:06.94]好不容易又能再多爱一天
                [02:13.50]但故事的最后你好像还是说了拜拜
                [02:34.90]为你翘课的那一天
                [02:36.88]花落的那一天
                [02:38.66]教室的那一间
                [02:40.39]我怎么看不见
                [02:42.15]消失的下雨天
                [02:43.87]我好想再淋一遍
                [02:48.00]没想到失去的勇气我还留着
                [02:54.15]好想再问一遍
                [02:56.03]你会等待还是离开
                [03:02.92]刮风这天我试过握着你手
                [03:08.49]但偏偏雨渐渐大到我看你不见
                [03:16.94]还要多久我才能在你身边
                [03:23.43]等到放晴的那天也许我会比较好一点
                [03:30.87]从前从前有个人爱你很久
                [03:37.14]偏偏风渐渐把距离吹得好远
                [03:44.88]好不容易又能再多爱一天
                [03:51.42]但故事的最后你好像还是说了拜拜
                [03:58.49]刮风这天我试过握着你手
                [04:01.97]但偏偏雨渐渐大到我看你不见
                [04:05.65]还要多久我才能够在你身边
                [04:09.07]等到放晴那天也许我会比较好一点
                [04:12.92]从前从前有个人爱你很久
                [04:15.91]但偏偏雨渐渐把距离吹得好远
                [04:19.38]好不容易又能再多爱一天
                [04:22.86]但故事的最后你好像还是说了拜
            </pre>
        <pre class="aplayer-lrc-content">
                [ti:04.鼓楼 New]
                [ar: ]
                [al:]
                [by:]
                [offset:0]
                [00:00.08]鼓楼 (The Drum Tower) - 赵雷
                [00:00.72]词：赵雷
                [00:00.85]曲：赵雷
                [00:00.98]编曲：赵雷/喜子
                [00:01.24]制作人：赵雷/喜子/姜北生
                [00:01.67]贝斯：张岭
                [00:01.83]鼓：贝贝
                [00:01.97]电琴：喜子
                [00:02.14]箱琴：赵雷
                [00:02.30]口琴：赵雷
                [00:02.47]MIDI：喜子
                [00:02.60]和声：赵雷/孙嫣然/唐宁
                [00:03.31]
                [00:26.02]我走在鼓楼下面 路在堵着
                [00:33.49]
                [00:34.03]雨后的阳光洒落 人们都出来了
                [00:41.19]
                [00:42.25]执着的迷惘的文艺青年很多
                [00:50.20]如果我无聊了就会来这里坐坐
                [00:57.52]
                [00:58.24]我是个沉默不语的
                [01:01.79]靠着墙壁晒太阳的过客
                [01:06.35]如果我有些倦意了
                [01:09.88]就让我在这里独自醒过
                [01:15.19]我站在鼓楼上面
                [01:18.33]
                [01:19.22]一切繁华与我无关
                [01:23.15]这是个拥挤的地方 而我却很平凡
                [01:30.69]
                [01:47.24]我走在鼓楼下面 淋湿的咖啡馆
                [01:55.48]睡不着的后海边 月亮还在抽着烟
                [02:02.88]
                [02:03.63]喝醉的亲吻着 快活的人不眠
                [02:11.75]唯有我倚着围栏 对过往说晚安
                [02:19.61]
                [02:52.32]我是个沉默不语的
                [02:55.73]靠着车窗想念你的乘客
                [03:00.29]当107 路再次经过
                [03:04.25]时间是带走青春的电车
                [03:09.00]我站在什刹海边一切甜蜜与我无关
                [03:17.04]这是个拥挤的地方 而我却很孤单
                [03:24.46]我在鼓楼 我在鼓楼
                [03:32.79]我在鼓楼 我在鼓楼
                [03:44.97]我在鼓楼 我在鼓楼
           </pre>
        <pre class="aplayer-lrc-content">
[ti:Shots (Broiler Remix)]
[ar:Imagine Dragons/Broiler]
[al:Shots]
[by:]
[offset:0]
[00:00.00]Shots (射击) (Broiler Remix) - Imagine Dragons (梦龙)/Broiler
[00:02.78]Lyrics by：Imagine Dragons
[00:05.56]Composed by：Imagine Dragons
[00:08.35]Am I out of touch
[00:10.36]Am I out of my place
[00:12.55]When I keep sayin' that I'm lookin' for an empty space
[00:16.38]Oh I'm wishin' you're here but I'm wishin' you're gone
[00:20.55]I can't have you and I'm only gonna do you wrong
[00:24.32]Oh I'm gonna mess this up oh this is just my luck
[00:28.28]Over and over and over again
[00:31.83]In the mean time we let it go
[00:33.92]At the road sign we used to know
[00:35.75]We can let this drift away
[00:37.84]Oh we let this drift away
[00:39.75]And there's always time to change your mind
[00:41.84]And there's always time to change your mind
[00:43.76]And there's always time to change your mind
[00:45.68]Oh love can you hear me
[01:04.48]I'm sorry for everything oh everything I've done
[01:07.82]From the second that I was born I think I had a loaded gun
[01:11.56]And then I shot shot shot a hole through everything I loved
[01:15.55]Oh I shot shot shot a hole through every single thing that I loved
[01:36.40]Am I out of luck
[01:38.33]Am I waiting to break
[01:40.39]When I keep sayin' that I'm lookin' for a way to escape
[01:44.38]Oh I'm wishin' I had what I'm takin' for granted
[01:48.57]I can't have you and I'm only gonna do you wrong
[01:52.31]Oh I'm gonna mess this up oh this is just my luck
[01:56.26]Over and over and over again
[01:59.90]In the mean time we let it go
[02:01.68]At the road sign we used to know
[02:03.81]We can let this drift away
[02:05.80]Oh we let this drift away
[02:07.79]And there's always time to change your mind
[02:09.68]And there's always time to change your mind
[02:11.67]And there's always time to change your mind ohoh
[02:15.32]Can you hear me
[02:32.35]I'm sorry for everything oh everything I've done
[02:35.73]From the second that I was born I think I had a loaded gun
[02:39.42]And then I shot shot shot a hole through everything I loved
[02:43.72]Oh I shot shot shot a hole through every single thing that I loved
           </pre>
        <pre class="aplayer-lrc-content">
               [ti:有何不可]
[ar:许嵩]
[al:自定义]
[by:]
[offset:0]
[00:00.00]有何不可 - 许嵩 (Vae Xu)
[00:05.76]词：许嵩
[00:11.53]曲：许嵩
[00:17.30]编曲：许嵩
[00:23.07]天空好想下雨
[00:25.13]我好想住你隔壁
[00:27.41]傻站在你家楼下
[00:29.42]抬起头 数乌云
[00:31.86]如果场景里出现一架钢琴
[00:34.19]我会唱歌给你听
[00:36.59]哪怕好多盆水往下淋
[00:39.69]
[00:41.95]夏天快要过去
[00:44.00]请你少买冰淇淋
[00:46.42]天凉就别穿短裙
[00:48.63]别再那么淘气
[00:51.04]如果有时不那么开心
[00:53.37]我愿意将格洛米借给你
[00:55.65]你其实明白我心意
[00:59.01]为你唱这首歌
[01:01.24]没有什么风格
[01:03.55]它仅仅代表着
[01:05.34]
[01:05.97]我想给你快乐
[01:08.32]为你解冻冰河
[01:10.71]为你做一只扑火的飞蛾
[01:14.23]没有什么事情是不值得
[01:17.91]为你唱这首歌
[01:20.26]没有什么风格
[01:22.55]它仅仅代表着
[01:24.34]
[01:24.94]我希望你快乐
[01:27.38]为你辗转反侧
[01:29.77]为你放弃世界有何不可
[01:33.10]夏末秋凉里带一点温热
[01:36.86]有换季的颜色
[01:39.53]
[01:58.10]天空好想下雨
[02:00.05]我好想住你隔壁
[02:02.37]傻站在你家楼下
[02:04.53]抬起头 数乌云
[02:06.87]如果场景里出现一架钢琴
[02:09.43]我会唱歌给你听
[02:11.67]哪怕好多盆水往下淋
[02:13.97]
[02:14.63]往下淋往下淋
[02:16.78]夏天快要过去
[02:19.03]请你少买冰淇淋
[02:21.41]天凉就别穿短裙
[02:23.45]别再那么淘气
[02:26.03]如果有时不那么开心
[02:28.34]我愿意将格洛米借给你
[02:30.62]你其实明白我心意
[02:34.03]为你唱这首歌
[02:36.28]没有什么风格
[02:38.56]它仅仅代表着
[02:41.03]我想给你快乐
[02:43.35]为你解冻冰河
[02:45.74]为你做一只扑火的飞蛾
[02:49.24]没有什么事情是不值得
[02:52.92]为你唱这首歌
[02:55.30]没有什么风格
[02:57.63]它仅仅代表着
[02:59.99]我希望你快乐
[03:02.37]为你辗转反侧
[03:04.71]为你放弃世界有何不可
[03:08.05]夏末秋凉里带一点温热
[03:11.31]
[03:21.67]为你解冻冰河
[03:23.90]为你做一只扑火的飞蛾
[03:27.11]没有什么事情是不值得
[03:30.37]
[03:31.14]为你唱这首歌
[03:33.25]没有什么风格
[03:35.59]它仅仅代表着
[03:38.03]我希望你快乐
[03:40.44]为你辗转反侧
[03:42.77]为你放弃世界有何不可
[03:46.13]夏末秋凉里带一点温热
[03:49.74]有换季的颜色
           </pre>
        <pre class="aplayer-lrc-content">
[ti:浪人琵琶]
[ar:胡66]
[al:浪人琵琶]
[by:]
[offset:0]
[00:00.00]浪人琵琶 - 胡66
[00:00.41]词：单色凌
[00:00.82]曲：单色凌
[00:01.23]编曲：单色凌/王中易/高漠伊
[00:01.64]制作人：单色凌
[00:02.06]男声：单色凌
[00:02.47]戏腔：单色凌
[00:02.88]吉他：高漠尹
[00:03.29]录音：吕晓菲
[00:03.70]混音：李琰祥
[00:04.12]和声：曾婕
[00:04.53]监制：单色凌
[00:04.94]录音室：Hikoon Beijing
[00:05.35]制作公司：Hikoon Music
[00:05.78]小生的花伞还落在你家
[00:09.00]你美眷如花
[00:10.08]我浪迹天涯
[00:11.99]
[00:12.51]为我泡杯花茶
[00:14.10]和你有些不搭
[00:15.84]气氛开始有一点尴尬
[00:18.94]你腼腆一笑
[00:20.07]竟如此融洽
[00:22.36]我情不自禁会为你牵挂
[00:26.22]什么时代
[00:27.19]
[00:27.89]早已经不想回家
[00:30.95]
[00:32.83]你微微一笑
[00:34.24]蝴蝶为你倾倒
[00:35.51]
[00:36.23]凝眸几秒
[00:37.37]不知道该干嘛
[00:38.95]
[00:39.49]你拂袖模样
[00:41.64]情千变万化
[00:44.52]
[00:46.25]一壶好酒
[00:47.50]趁着夜还未央
[00:49.01]
[00:49.60]独自品尝
[00:50.71]这大把好时光
[00:52.39]
[00:53.27]夜深人静
[00:54.83]略显一丝凄凉
[00:57.98]
[00:59.60]东奔西走
[01:00.90]微醺不宜骑马
[01:02.47]听着浪人
[01:03.43]弹着断了弦的琵琶
[01:05.56]
[01:06.26]路过青楼酒馆
[01:07.93]官人进来坐坐好吗
[01:11.04]
[01:12.76]我的思念
[01:14.54]似六月里的小雨哗哗
[01:19.53]对你情有所钟
[01:21.49]为你两袖清风
[01:25.07]
[01:25.76]小生的花伞还落在你家
[01:28.96]你美眷如花
[01:30.06]我浪迹天涯
[01:32.43]为我泡杯花茶
[01:34.11]和你有些不搭
[01:35.81]气氛开始有一点尴尬
[01:38.95]你腼腆一笑
[01:40.06]竟如此融洽
[01:42.39]我情不自禁会为你牵挂
[01:46.23]什么时代
[01:47.84]早已经不想回家
[01:51.03]
[02:06.68]东奔西走
[02:07.66]微醺不宜骑马
[02:09.16]听着浪人
[02:10.00]弹着断了弦的琵琶
[02:12.11]
[02:12.90]路过青楼酒馆
[02:14.50]官人进来坐坐好吗
[02:18.09]
[02:19.19]我的思念
[02:21.43]似六月里的小雨哗哗
[02:26.25]对你情有所钟
[02:28.15]为你两袖清风
[02:31.55]
[02:32.30]小生的花伞还落在你家
[02:35.53]你美眷如花
[02:36.65]我浪迹天涯
[02:39.00]为我泡杯花茶
[02:40.68]和你有些不搭
[02:42.32]气氛开始有一点尴尬
[02:45.51]你腼腆一笑
[02:46.65]竟如此融洽
[02:48.89]我情不自禁会为你牵挂
[02:52.20]
[02:52.85]什么时代
[02:54.44]早已经不想回家
[02:57.69]
[02:58.94]我化成风
[03:00.47]
[03:01.38]不舍一帘美梦
[03:04.65]
[03:05.33]醉醒穿梭
[03:07.54]
[03:08.09]终究是一场空
[03:12.21]若非是你
[03:14.71]今生又怎会懂
[03:18.40]
[03:19.14]浪人回头
[03:21.53]心动则心痛
           </pre>
        <pre class="aplayer-lrc-content">
[ti:最爱]
[ar:周慧敏]
[al:最爱]
[by:]
[offset:0]
[00:00.00]最爱 - 周慧敏 (Vivian Chow)
[00:03.43]词：李克勤
[00:06.87]曲：中岛美雪
[00:10.31]编曲：卢东尼
[00:13.75]天空一片蔚蓝
[00:15.82]清风添上了浪漫
[00:18.14]心里那份柔情蜜意似海
[00:22.49]
[00:23.02]无限
[00:26.36]
[00:31.83]在那遥远有意无意遇上
[00:35.41]共你初次邂逅谁没有遐想
[00:39.13]
[00:39.91]诗一般的落霞
[00:42.00]酒一般的夕阳
[00:44.09]似是月老给你我留印象
[00:47.92]
[00:48.62]斜阳离去朗月已换上
[00:52.46]没法掩盖这份情欲盖弭彰
[00:56.11]
[00:56.92]这一刹情一缕影一对人一双
[01:01.13]那怕热炽爱一场
[01:04.45]
[01:05.14]潮汐退和涨
[01:07.40]月冷风和霜
[01:09.24]夜雨的狂想
[01:11.50]野花的微香
[01:13.56]伴我星夜里幻想
[01:17.19]
[01:17.82]方知不用太紧张
[01:23.53]
[01:24.36]没法隐藏这份爱
[01:27.91]
[01:28.44]是我深情深似海
[01:32.06]
[01:32.74]一生一世难分开难改变也难
[01:36.38]再让你的爱满心内
[01:41.07]
[02:03.07]在那遥远有意无意遇上
[02:06.75]共你初次邂逅谁没有遐想
[02:10.29]
[02:11.19]诗一般的落霞
[02:13.30]酒一般的夕阳
[02:15.44]似是月老给你我留印象
[02:19.24]
[02:19.97]斜阳离去朗月已换上
[02:23.77]没法掩盖这份情欲盖弭彰
[02:27.31]
[02:28.24]这一刹情一缕影一对人一双
[02:32.43]那怕热炽爱一场
[02:35.71]
[02:36.42]潮汐退和涨
[02:38.53]月冷风和霜
[02:40.67]夜雨的狂想
[02:42.75]野花的微香
[02:44.87]伴我星夜里幻想
[02:49.17]方知不用太紧张
[02:55.08]
[02:55.65]没法隐藏这份爱
[02:59.65]是我深情深似海
[03:03.33]
[03:03.93]一生一世难分开难改变也难
[03:07.66]再让你的爱满心内
[03:11.91]
[03:12.51]潮汐退和涨
[03:14.60]月冷风和霜
[03:16.67]夜雨的狂想
[03:18.94]野花的微香
[03:20.89]伴我星夜里幻想
[03:24.56]
[03:25.20]方知不用太紧张
[03:31.04]
[03:31.77]没法隐藏这份爱
[03:35.31]
[03:35.84]是我深情深似海
[03:39.46]
[03:40.01]一生一世难分开难改变也难
[03:43.79]再让你的爱满心内
[03:48.08]让我的爱全给你全给我最爱
[03:52.85]地老天荒仍未改
           </pre>
        <pre class="aplayer-lrc-content">
[ti:野孩子]
[ar:杨千嬅]
[al:Miriam]
[by:]
[offset:0]
[00:00.00]野孩子 - 杨千嬅 (Miriam Yeung)
[00:03.96]词：黄伟文
[00:07.92]曲：雷颂德
[00:11.88]就算只谈一场感情
[00:15.67]除外都是一时虚荣
[00:19.77]不等于 在蜜月套房游玩过
[00:23.99]就可自入自出仙境
[00:27.65]情愿获得你的尊敬
[00:31.70]承受太高傲的罪名
[00:35.69]挤得进你臂弯
[00:37.85]如情怀渐冷
[00:39.74]未算孤苦也伶仃
[00:42.83]明知爱这种男孩子
[00:45.68]也许只能如此
[00:47.99]但我会成为你最牵挂的一个女子
[00:52.15]朝朝暮暮让你猜想如何驯服我
[00:56.01]若果亲手抱住
[00:57.97]或者不必如此
[01:00.44]许多旁人说我不太明了男孩子
[01:04.14]不受命令就是一种最坏名字
[01:08.09]笑我这个毫无办法管束的野孩子
[01:13.60]连没有幸福都不介意
[01:27.79]若我依然坚持忠诚
[01:31.66]难道你又适合安定
[01:35.56]真可惜说要吻我的还未吻
[01:39.87]自己就自梦中苏醒
[01:43.54]离场是否有点失敬
[01:47.59]还是更轰烈的剧情
[01:51.64]必须有这结果
[01:53.69]才能怀念我
[01:55.64]让我于荒野驰骋
[01:58.82]明知爱这种男孩子
[02:01.62]也许只能如此
[02:03.98]但我会成为你最牵挂的一个女子
[02:08.10]朝朝暮暮让你猜想如何驯服我
[02:11.96]若果亲手抱住
[02:13.99]或者不必如此
[02:16.17]许多旁人说我不太明了男孩子
[02:20.08]不受命令就是一种最坏名字
[02:24.10]笑我这个毫无办法管束的野孩子
[02:29.64]连没有幸福都不介意
[02:47.15]明知爱这种男孩子
[02:50.13]也许只能如此
[02:52.11]但我会成为你最牵挂的一个女子
[02:56.13]朝朝暮暮让你猜想如何驯服我
[02:59.97]若果亲手抱住
[03:01.93]或者不必如此
[03:04.14]许多旁人说我不太明了男孩子
[03:08.03]不受命令就是一种最坏名字
[03:12.11]我也笑我原来是个天生的野孩子
[03:17.65]连没有幸福都不介意
           </pre>
        <pre class="aplayer-lrc-content">
[ti:淋雨一直走]
[ar:张韶涵]
[al:有形的翅膀]
[by:]
[offset:0]
[00:00.00]淋雨一直走 (Keep Walking) - 张韶涵 (Angela Zhang)
[00:00.78]词：姚若龙
[00:01.57]曲：Hermanni Kovalainen/Ilanguaq Lumholt/Henrik Tala
[00:02.36]Oh
[00:04.54]人都应该有梦
[00:07.13]有梦就别怕痛
[00:11.47]有雷声在轰不停
[00:14.03]雨泼进眼里看不清
[00:16.64]谁急速狂飙
[00:18.02]溅我一身
[00:19.57]的泥泞
[00:21.63]我决定我想去哪里
[00:24.25]往天堂要跳过地狱
[00:26.88]也不恐惧
[00:28.32]不逃避
[00:30.22]这不是脾气
[00:32.72]是所谓志气
[00:35.27]与勇气
[00:36.59]你能推我下悬崖
[00:39.09]我能学会飞行
[00:41.00]从不听
[00:43.19]谁的命令
[00:45.48]很独立
[00:46.75]耳朵用来听自己的心灵
[00:51.31]淋雨一直走
[00:53.75]是一颗宝石就该闪烁
[00:56.97]人都应该有梦
[00:58.39]Oh
[00:59.40]有梦就别怕痛
[01:01.53]淋雨一直走
[01:04.00]是道阳光就该暖和
[01:07.12]人都应该有梦
[01:08.73]Oh
[01:09.62]有梦就别怕痛
[01:13.65]
[01:14.96]有前面盘旋的秃鹰
[01:17.77]有背后尖酸的耳语
[01:20.39]黑色的童话
[01:21.83]是给长大
[01:23.45]的洗礼
[01:25.48]要独特才是流行
[01:28.11]无法复制的自己
[01:30.52]让我连受伤
[01:32.08]也有型
[01:34.01]这不是脾气
[01:36.51]是所谓志气
[01:39.07]与勇气
[01:40.35]你能推我下悬崖
[01:42.85]我能学会飞行
[01:44.83]从不听
[01:46.98]谁的命令
[01:49.35]很独立
[01:50.57]耳朵用来听自己的心灵
[01:54.98]淋雨一直走
[01:57.49]是一颗宝石就该闪烁
[02:00.71]人都应该有梦
[02:02.15]Oh
[02:03.28]有梦就别怕痛
[02:05.25]淋雨一直走
[02:07.84]是道阳光就该暖和
[02:10.95]人都应该有梦
[02:12.69]Oh
[02:13.32]有梦就别怕痛
[02:16.99]有时掉进黑洞
[02:19.18]有时候爬上彩虹
[02:21.64]在下一秒钟
[02:22.89]命运如何转动
[02:24.07]没有人会晓得
[02:25.38]Oh
[02:26.69]我说希望无穷
[02:29.35]你猜美梦成空
[02:31.94]相信和怀疑
[02:33.44]总要决斗
[02:38.39]淋雨一直走
[02:40.99]是一颗宝石就该闪烁
[02:44.13]人都应该有梦
[02:45.88]Oh
[02:46.63]有梦就别怕痛
[02:48.66]淋雨一直走
[02:51.20]是道阳光就该暖和
[02:54.28]人都应该有梦
[02:56.15]Oh
[02:56.84]有梦就别怕痛
[02:58.94]淋雨一直走
[03:01.42]是一颗宝石就该闪烁
[03:04.56]人都应该有梦
[03:06.31]Oh
[03:07.00]有梦就别怕痛
[03:09.15]淋雨一直走
[03:11.63]是道阳光就该暖和
[03:14.71]人都应该有梦
[03:16.46]Oh
[03:17.21]有梦就别怕痛
           </pre>
        <pre class="aplayer-lrc-content">
[ti:Run Free (Radio Edit)]
[ar:Deep Chills/IVIE]
[al:Run Free]
[by:]
[offset:0]
[00:00.00]Run Free (Radio Edit) - Deep Chills/IVIE
[00:01.41]I still remember
[00:02.78]
[00:03.73]Loving the danger
[00:05.33]
[00:05.94]You set me on fire
[00:07.34]When I'm by your side
[00:09.20]
[00:10.88]You taking me higher
[00:12.65]I follow you down
[00:13.80]If we go down
[00:15.33]Now you say you wanna get away
[00:16.77]
[00:17.60]You wanna take me all the way
[00:20.01]
[00:20.54]Might get burned
[00:22.16]If you get too closer
[00:24.10]To the sun
[00:24.90]I want yah
[00:26.30]We can burn together
[00:28.24]Fading into one another
[00:31.86]Ooooh
[00:35.46]
[00:36.43]Oh don't you know
[00:37.98]
[00:38.71]You're still heaven to me
[00:41.11]Baby we could run free
[00:43.27]If you do it just the way I like
[00:46.11]Maybe I could waste my time on you
[00:49.33]
[00:50.21]Never mind all our worries
[00:51.90]
[00:53.07]If you do it just the way I like
[00:55.75]Maybe I could waste my time on you
[00:58.93]
[01:20.48]My deepest of secrets
[01:22.19]
[01:22.89]Trust you to keep 'em
[01:24.48]
[01:25.26]Hiding the worlds
[01:26.86]You cannot say
[01:28.43]
[01:29.96]I got what you wanted
[01:31.57]
[01:32.32]I got what you needed
[01:34.02]
[01:34.78]It's all in the way
[01:36.38]That you say my name
[01:37.82]
[01:39.75]Might get burned
[01:41.48]If you get too closer
[01:43.28]To the sun
[01:44.12]I want yah
[01:45.62]We can burn together
[01:47.50]Fading into one another
[01:51.02]Ooooh
[01:54.59]
[01:55.64]Well don't you know
[01:57.06]
[01:57.87]You're still heaven to me
[01:59.80]Baby we could run free
[02:02.15]If you do it just the way I like
[02:05.30]Maybe I could waste my time on you
[02:08.45]
[02:09.49]Never mind all our worries
[02:11.17]
[02:12.27]If you do it just the way I like
[02:14.97]Maybe I could waste my time on you
[02:18.14]
[02:31.90]If you do it just the way I like
[02:34.29]Maybe I could waste my time on you
[02:37.31]
[02:38.27]Never mind all our worries
[02:39.92]
[02:41.00]If you do it just the way I like
[02:43.73]Maybe I could waste my time on you
           </pre>
    </div>
</template>

<script>
    // aplayer包含有window,但是服务端渲染 无window对象。这里需要判断是否处于服务端
    if (process.client) {
      var APlayer = require('aplayer')
    }
    import Drag from '../utils/Drag'
    export default {
        name: "aplayer-mc",
        props: {
          value: {
            type: Boolean,
            default: false
          }
        },
        data () {
          return {
            styleObj1: {minWidth: 66+ 'px', maxWidth: 400 + 'px'}
          }
        },
        mounted () {
            Drag()
            this.ap = new APlayer({
                container: document.getElementById('aplayer'),
                autoplay: true,
                showlrc: true,
                listMaxHeight: '150px',
                // 开发模式下不显示歌词，是正常的
                audio: [
                    {
                        name: '芒种',
                        artist: '赵方婧',
                        url: 'https://35dinghuo.oss-cn-hangzhou.aliyuncs.com/static/mangzhong.mp3',
                        cover: 'https://www.umyui.com/music/mz.jpg'
                    },
                    {
                        name: '晴天',
                        artist: '周杰伦',
                        url: 'https://www.umyui.com/music/qingtian.mp3',
                        cover: 'https://www.umyui.com/music/zjl.png'
                    },
                    {
                        name: '鼓楼',
                        artist: '赵雷',
                        url: 'https://www.umyui.com/music/gulou.mp3',
                        cover: 'https://www.umyui.com/music/zhaolei.png'
                    },
                    {
                        name: 'Shots',
                        artist: 'imagine dragons',
                        url: 'https://www.umyui.com/music/Shots.mp3',
                        cover: 'https://www.umyui.com/music/shots.png'
                    },
                    {
                        name: '有何不可',
                        artist: '许嵩',
                        url: 'https://www.umyui.com/music/youhebuke.mp3',
                        cover: 'https://www.umyui.com/music/xusong.png'
                    },
                    {
                        name: '浪人琵琶',
                        artist: '胡66',
                        url: 'https://www.umyui.com/music/langrenpipa.mp3',
                        cover: 'https://www.umyui.com/music/hu66.png'
                    },
                    {
                        name: '最爱',
                        artist: '周慧敏',
                        url: 'https://www.umyui.com/music/zuiai.mp3',
                        cover: 'https://www.umyui.com/music/zhouhuimin.png'
                    },
                    {
                        name: '野孩子',
                        artist: '杨千嬅',
                        url: 'https://www.umyui.com/music/yehaizi.mp3',
                        cover: 'https://www.umyui.com/music/yangqianhua.png'
                    },
                    {
                        name: '淋雨一直走',
                        artist: '张韶涵',
                        url: 'https://www.umyui.com/music/lyyzz.mp3',
                        cover: 'https://www.umyui.com/music/zhangshaohan.png'
                    },
                    {
                        name: 'Run Free',
                        artist: 'Deep Chills _ IVIE',
                        url: 'https://www.umyui.com/music/runFree.mp3',
                        cover: 'https://www.umyui.com/music/runFree.png'
                    }
                ]
            });
            if (this.ap) {
              this.ap.setMode(this.value ? 'mini' : 'normal')
            }
            this.setWidth()
        },
        methods: {
          setWidth () {
             if (this.value) {
                this.styleObj1 = {minWidth: 66 + 'px', maxWidth: 400 + 'px'}
             } else {
               this.styleObj1 = {minWidth: 500 + 'px', maxWidth: 600 + 'px'}
             }
          }
        },
        watch: {
          value: function (val) {
            if (this.ap) {
              this.ap.setMode(val ? 'mini' : 'normal')
            }
            this.setWidth()
          }
        }
    }
</script>

<style lang="scss">
    .aplayer .aplayer-lrc p.aplayer-lrc-current {
        color: $dh-color !important;
    }
    .aplayer {
        position: fixed !important;
        left: 250px;
        top: 60px;
        z-index: 10000;
    }
</style>
